{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              4
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 5,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 3,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "dense_2",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "hash": "0c621cb6b272cb10541d3340050a95e119700366d4f53e6f90f913e87fb56c99",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1,
      1,
      1,
      1,
      4
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            1,
            1,
            1,
            1,
            4
          ],
          "values": [
            "TNYQvgj7XT9tDvU/92B+Pw=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            1,
            1,
            3
          ],
          "values": [
            "3k+yPodskD6aQ70+"
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "dense_1": {
      "bias": [
        "29uCPAAAAAAAAAAAAAAAAAAAAAA="
      ],
      "weights": [
        "zxmMvjNrQb+eEkw/oGYyP9vVE7/rrk0/18lFv3BIoz2Eagi/cvgJv/5inL0ZdKy+ZuM1v99aSb+AMRy9huRpvoALFD8lrNW+cEEMPlRGHb8="
      ]
    },
    "dense_2": {
      "bias": [
        "+haDPA4rgryBL4E8"
      ],
      "weights": [
        "hP/kPiDc0rwxARs/tMz4vtldGD8YTvq9lZYhPwtPPD8Y1AC+IM+1PQJH2D40020+/14pv6ekVT8HPio/"
      ]
    }
  }
}
